1s/ERP/Conf/Catalogs/Лико_СхемыДоступаКДанным.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_СхемыДоступаКДанным</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загрузил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_СхемыДоступаКДанным/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Перем СКД1 Экспорт;
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьКомпоновкуДанных();
КонецПроцедуры




&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(СКД=Неопределено)
	
	Если СКД<>Неопределено Тогда 
		СхемаКомпоновкиДанных=СКД;
		
		ТекОбъект = РеквизитФормыВЗначение("Объект"); 
		
		ТекОбъект.схемаДанных=Новый ХранилищеЗначения(СКД);
		СКД1=СКД;
		
		
	Иначе
		ТекОбъект = РеквизитФормыВЗначение("Объект"); 
		СхемаКомпоновкиДанных = ТекОбъект.СхемаДанных.Получить();
		Если СхемаКомпоновкиДанных=Неопределено ТОгда
			Возврат;
		КонецЕсли;
		
		//
		//ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xml"); // получаем имя временного файла на сервере
		//ДД.Записать(ИмяВременногоФайла);                        // записываем двоичные данные  
		////перенос файла с клиента на сервер завершен, на сервере создался файл с путем в переменной - "ИмяВременногоФайла"
		//ЧтениеXML = Новый ЧтениеXML;
		//ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
		////ЧтениеXML.УстановитьСтроку(НайтиСтрокуЗапроса.СхемаКомпоновкиДанныхТаблицы); - если чтение не из файла, а из строки
		//
		////ТекОбъект.схемаДанных=Новый ХранилищеЗначения(ЧтениеXML);
		//СКД = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("СхемаКомпоновкиДанных")); 
		//ТекОбъект.схемаДанных=Новый ХранилищеЗначения(СКД);
		//
		//
		//
		
		
	КонецЕсли;
	Если СхемаКомпоновкиДанных=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	АдресСКД=URLСхемы;
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	СхемаДоступаКДанным.Инициализировать(ИсточникНастроек);
	
	
	////ТекОбъект = РеквизитФормыВЗначение("Объект");
	////ТекНастройки = ТекОбъект.ОтборНастройки.Получить();
	////Если ТекНастройки = Неопределено Тогда
	////	
	////	ОтборПоусловию.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	////Иначе
	////	ОтборПоусловию.ЗагрузитьНастройки(ТекНастройки);
	////КонецЕсли;
	////
	////ОтборПоусловию.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	//УстановитьЗначениеПараметраНастроек(ОтборПересчета.Настройки, "Склад" , Объект.Склад);
	//УстановитьЗначениеПараметраНастроек(ОтборПересчета.Настройки, "Помещение", Объект.Помещение);
СформироватьНадписьЗагрузкиСхемы();	
КонецПроцедуры

&НаКлиенте
Процедура ИмяИсточникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Структура = Новый Структура;
	Структура.Вставить("Источник",Объект.Источник);
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещения= Новый ОписаниеОповещения("ВыборОбъектаЗавершение",ЭтаФорма,Структура);
	ОткрытьФорму("Справочник.Лико_СхемыДоступаКДанным.Форма.ФормаВыбораОбъекта",Структура,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

Процедура ВыборОбъектаЗавершение (Результат,Параметры) Экспорт
	
	Если ТипЗнч(Результат)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект,Результат);
	КонецЕсли;
	
	
КонецПроцедуры 


&НаКлиенте
Процедура ОткрытьФайл(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файлы XML (*.xml) |*.xml";
	Если НЕ Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	
	Попытка
		ЧтениеXML.ОткрытьФайл(Диалог.ПолноеИмяФайла);
	Исключение
		Сообщить("Невозможно открыть xml-файл");
		Возврат;
	КонецПопытки;
	
	
	АдресВременногоХранилища = "";
	ПоместитьФайл(АдресВременногоХранилища, Диалог.ПолноеИмяФайла,,Ложь, ЭтаФорма.УникальныйИдентификатор); // помещаем наш файл во временное хранилище (для его передачи на сервер)
	
	ВыгрузитьВXMLНаСервере(АдресВременногоХранилища);
	
	СформироватьНадписьЗагрузкиСхемы();
	
	
КонецПроцедуры



&НаСервере
Функция  ВыгрузитьВXMLНаСервере(АдресВременногоХранилища)
	
	ДД = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);  // вытаскиваем на сервере из временного хранилища как двоичные данные
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xml"); // получаем имя временного файла на сервере
	ДД.Записать(ИмяВременногоФайла);                        // записываем двоичные данные  
	//перенос файла с клиента на сервер завершен, на сервере создался файл с путем в переменной - "ИмяВременногоФайла"
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	//ЧтениеXML.УстановитьСтроку(НайтиСтрокуЗапроса.СхемаКомпоновкиДанныхТаблицы); - если чтение не из файла, а из строки
	ТекОбъект = РеквизитФормыВЗначение("Объект"); 
	//ТекОбъект.схемаДанных=Новый ХранилищеЗначения(ЧтениеXML);
	СКД = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("СхемаКомпоновкиДанных")); 
	ТекОбъект.схемаДанных=Новый ХранилищеЗначения(СКД);
	
	ИнициализироватьКомпоновкуДанных(СКД);
	Объект.ДатаЗагрузки=ТекущаяДата();
	Объект.Загрузил= ПользователиКлиентСервер.ТекущийПользователь(); 
  
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ХДТО = Новый СериализаторXDTO(ФабрикаXDTO);
	//ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xml");
	//ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
	//
	//ХДТО.ЗаписатьXML(ЗаписьXML,ТекущийОбъект.СхемаДанных,НазначениеТипаXML.Явное); 
	//
	////Данные=Новый ДвоичныеДанные(ИмяВременногоФайла);
	////
	//
	//
	ТекущийОбъект.СхемаДанных = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСКД));
	//
	//
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСхемы(Команда)
#Если ТолстыйКлиентУправляемоеПриложение  Тогда
	Если АдресСКД=Неопределено Тогда
		СКД=Новый СхемаКомпоновкиДанных;
		АдресСКД=ПоместитьВоВременноеХранилище(Скд);
	КонецЕсли;
	КонструкторСКД=Новый КонструкторСхемыКомпоновкиДанных(ПолучитьИзВременногоХранилища(АдресСКД));
	КонструкторСКД.Редактировать(ЭтаФорма);
#Иначе
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Редактирование схемы компоновки данных доступа к данным возможно только в толстом клиенте!";
	Сообщение.Сообщить();
#КонецЕсли	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ИсточникВыбора) = Тип("КонструкторСхемыКомпоновкиДанных") Тогда
		СКД = ИсточникВыбора.ПолучитьСхему(); 		
		ИнициализироватьКомпоновкуДанных(СКД);
		СформироватьНадписьЗагрузкиСхемы();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНадписьЗагрузкиСхемы() //+Лико m.shenderov 17.03.2019

	Если ЗначениеЗаполнено(Объект.Загрузил) Тогда
		НадписьЗагрузкиСхемы="Загрузил: "+Объект.Загрузил+" дата: "+Формат(Объект.ДатаЗагрузки,"ДЛФ=DT");
	Иначе
		НадписьЗагрузкиСхемы="Схема не загружена";
		
	КонецЕсли;
	
	
КонецПроцедуры  //-Лико m.shenderov 17.03.2019
